app/views/books/_index3.html.erb

                <%= link_to book_favorites_path(book.id), method: :delete do %>
                <i class="fas fa-heart"></i> <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 7]]

                <%= link_to book_favorites_path(book.id), method: :post do %>
                <i class="far fa-heart"></i><%= book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

            <!--コメントview-->
            <i class="far fa-comment"></i> <%= link_to "#{book.book_comments.count} コメント" %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]