app/views/books/_index3.html.erb

        <!--コメントview-->
        <i class="far fa-comment"></i> <%=  "#{book.book_comments.count} コメント" %>
---
SELECT "books".* FROM "books"