app/views/books/_index2.html.erb

             <%= link_to book_favorites_path(book.id), method: :delete do %>
             ♥<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

              <%= link_to book_favorites_path(book.id), method: :post do %>
                ♡<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]

            <td>
             <p><%= link_to "#{book.book_comments.count} コメント" %></p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]