app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params) #ビューで投稿一覧を表示するために全取得。
    tag_list = params[:book][:tag_name].split(nil) #ビューでタグ一覧を表示するために全取得。
    @book.user_id = current_user.id
    if @book.save
       @book.save_tag(tag_list)
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ff"], ["body", "ff"], ["user_id", 1], ["created_at", "2021-05-04 01:36:34.056650"], ["updated_at", "2021-05-04 01:36:34.056650"]]
SELECT "books".* FROM "books"