app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ss"], ["user_id", 2], ["book_id", 1], ["created_at", "2021-05-04 09:31:43.626027"], ["updated_at", "2021-05-04 09:31:43.626027"]]
---
  def create
    @book_comment = BookComment.new
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 15]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 15], ["book_id", 4], ["LIMIT", 1]]
---
  def destroy
    @book_comment = BookComment.new
    @book = BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy