app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "relationships" ("created_at", "updated_at", "follower_id", "following_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-05-06 07:19:51.941005"], ["updated_at", "2021-05-06 07:19:51.941005"], ["follower_id", 1], ["following_id", 3]]
---
    def create
        @user = User.find(params[:user_id])
        follow = current_user.active_relationships.build(follower_id: params[:user_id])
        follow.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
---
    def destroy
      @user = User.find(params[:user_id])
      follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
      follow.destroy