app/controllers/users_controller.rb

UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "aa"], ["profile_image_id", "328c3716ac9fe67f7cfc56d1e7ca5a9c2631790e4170547bbf10c483d1ed"], ["updated_at", "2021-05-02 09:25:14.731819"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)