app/models/book.rb

SELECT "books".* FROM "books"
---
  def save_tag(sent_tags)
    # createにて保存した@bookに紐付いているタグが存在する場合「タグの名前を配列として」全て取得
    current_tags = self.tags.pluck(:tag_name) unless self.tags.nil?
    # 現在取得した@bookに存在するタグから、送信されてきたタグを除いたタグをold_tagsとする
    old_tags = current_tags - sent_tags
    # 送信されてきたタグから、現在存在するタグを除いたタグをnew_tagsとする
    new_tags = sent_tags - current_tags

    # 古いタグを削除
    old_tags.each do |old|